# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [10]:
# your code here
driver   = 'mysql+pymysql:'
user     = 'root'
password = 'urv19871028'
ip       = '127.0.0.1'
database = 'sakila'

In [11]:
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
print(connection_string)

mysql+pymysql://root:urv19871028@127.0.0.1/sakila

In [12]:
from sqlalchemy import create_engine
import pandas as pd

In [13]:
engine = create_engine(connection_string)
print(engine)

Engine(mysql+pymysql://root:***@127.0.0.1/sakila)

In [14]:
df = pd.read_sql('SELECT * FROM ACTOR', engine)
df.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 05:34:33
1         2       NICK      WAHLBERG 2006-02-15 05:34:33
2         3         ED         CHASE 2006-02-15 05:34:33
3         4   JENNIFER         DAVIS 2006-02-15 05:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 05:34:33

In [15]:
tables = pd.read_sql('SHOW TABLES;', engine)
tables

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [16]:
penelope_movies = pd.read_sql("""SELECT actor.actor_id AS ID, actor.first_name AS NOMBRE,
actor.last_name AS APELLIDO, film.title AS MOVIE 
FROM actor 
JOIN film_actor
ON actor.actor_id = film_actor.actor_id 
JOIN film 
ON film_actor.film_id = film.film_id
WHERE actor.actor_id = '1';
""", engine)
penelope_movies

    ID    NOMBRE APELLIDO                  MOVIE
0    1  PENELOPE  GUINESS       ACADEMY DINOSAUR
1    1  PENELOPE  GUINESS   ANACONDA CONFESSIONS
2    1  PENELOPE  GUINESS            ANGELS LIFE
3    1  PENELOPE  GUINESS  BULWORTH COMMANDMENTS
4    1  PENELOPE  GUINESS          CHEAPER CLYDE
5    1  PENELOPE  GUINESS     COLOR PHILADELPHIA
6    1  PENELOPE  GUINESS        ELEPHANT TROJAN
7    1  PENELOPE  GUINESS    GLEAMING JAWBREAKER
8    1  PENELOPE  GUINESS         HUMAN GRAFFITI
9    1  PENELOPE  GUINESS         KING EVOLUTION
10   1  PENELOPE  GUINESS             LADY STAGE
11   1  PENELOPE  GUINESS        LANGUAGE COWBOY
12   1  PENELOPE  GUINESS       MULHOLLAND BEAST
13   1  PENELOPE  GUINESS       OKLAHOMA JUMANJI
14   1  PENELOPE  GUINESS            RULES HUMAN
15   1  PENELOPE  GUINESS            SPLASH GUMP
16   1  PENELOPE  GUINESS      VERTIGO NORTHWEST
17   1  PENELOPE  GUINESS    WESTWARD SEABISCUIT
18   1  PENELOPE  GUINESS     WIZARD COLDBLOODED

# Challenge 2 - Working with JSON files

Import the pandas library.

In [17]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [19]:
# your code here
nasa = pd.read_json('/Users/Zak/Data-Analysis/second week/lab-import-export/data/nasa.json', orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [20]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [23]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [24]:
# your code here
nasa.to_json('/Users/Zak/Data-Analysis/second week/lab-import-export/data/nasa-output.json', orient='records')

In [28]:
ls '/Users/Zak/Data-Analysis/second week/lab-import-export/data/'

astronauts.xls*   nasa-output.json  nasa.json*

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [49]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class', 'extra_col']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [50]:
# your code here
shuttle = pd.read_csv(tst_url, sep=' ')
shuttle

       55  0   81  0.1  -6  11  25   88   64  4
0      56  0   96    0  52  -4  40   44    4  4
1      50 -1   89   -7  50   0  39   40    2  1
2      53  9   79    0  42  -2  25   37   12  4
3      55  2   82    0  54  -6  26   28    2  1
4      41  0   84    3  38  -4  43   45    2  1
...    .. ..  ...  ...  ..  ..  ..  ...  ... ..
14494  80  0   84    0 -36 -29   4  120  116  5
14495  55  0   81    0 -20  25  26  102   76  4
14496  55  0   77    0  12 -22  22   65   42  4
14497  37  0  103    0  18 -16  66   85   20  1
14498  56  2   98    0  52   1  42   46    4  4

[14499 rows x 10 columns]

In [51]:
shuttle.columns

Index(['55', '0', '81', '0.1', '-6', '11', '25', '88', '64', '4'], dtype='object')

In [52]:
shuttle.columns = cols

In [53]:
shuttle.columns

Index(['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass',
       'bpv_close', 'bpv_open', 'class', 'extra_col'],
      dtype='object')

Let's verify that this worked by looking at the `head()` function.

In [54]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class,extra_col
0,56,0,96,0,52,-4,40,44,4,4
1,50,-1,89,-7,50,0,39,40,2,1
2,53,9,79,0,42,-2,25,37,12,4
3,55,2,82,0,54,-6,26,28,2,1
4,41,0,84,3,38,-4,43,45,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [56]:
# your code here
shuttle.to_csv('/Users/Zak/Data-Analysis/second week/lab-import-export/data/shuttle.csv', sep=',', index=False)

In [57]:
ls '/Users/Zak/Data-Analysis/second week/lab-import-export/data/'

astronauts.xls*   nasa-output.json  nasa.json*        shuttle.csv

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [59]:
# your code here
astronaut = pd.read_excel('/Users/Zak/Data-Analysis/second week/lab-import-export/data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [60]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [61]:
# your code here
astronaut['Undergraduate Major'].value_counts()
# Physics... makes sense!

Physics                                35
Aerospace Engineering                  33
Mechanical Engineering                 30
Aeronautical Engineering               28
Electrical Engineering                 23
                                       ..
Ceramic Engineering                     1
Nuclear Engineering                     1
Earth & Planetary Science               1
Physics & Astronautical Engineering     1
Bioscience                              1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [63]:
# your code here
astronaut.to_csv('/Users/Zak/Data-Analysis/second week/lab-import-export/data/astronaut.csv', sep='\t', index=False)

In [64]:
ls '/Users/Zak/Data-Analysis/second week/lab-import-export/data/'

astronaut.csv     nasa-output.json  shuttle.csv
astronauts.xls*   nasa.json*

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [ ]:
# your code here